In [2]:
import pandas as pd

In [3]:
danh_sach1 = [{'Name': 'John', 'Age': 27}, {'Name': 'Tom', 'Age': 25}, {'Name': 'Jane', 'Age': 26}]
df1 = pd.DataFrame(danh_sach1, columns=['Name', 'Age'])
df1

   Name  Age
0  John   27
1   Tom   25
2  Jane   26

In [4]:
danh_sach2 = [{'Name': 'John', 'Phone': '123456'}, {'Name': 'Tom', 'Phone': '654987'}, {'Name': 'Jane', 'Phone': '123789'}]
df2 = pd.DataFrame(danh_sach2, columns=['Name', 'Phone'])
df2

   Name   Phone
0  John  123456
1   Tom  654987
2  Jane  123789

In [5]:
df_final = pd.merge(left=df1, right=df2, on='Name')
df_final

   Name  Age   Phone
0  John   27  123456
1   Tom   25  654987
2  Jane   26  123789

In [6]:
danh_sach3 = [{'Ten': 'Tom', 'Sex': 'Male'}, {'Ten': 'John', 'Sex': 'Male'}, {'Ten': 'Jane', 'Sex': 'Female'}]
df3 = pd.DataFrame(danh_sach3, columns=['Ten', 'Sex'])
df3

    Ten     Sex
0   Tom    Male
1  John    Male
2  Jane  Female

In [7]:
df_final2 = pd.merge(left=df_final, right=df3, left_on='Name', right_on='Ten')
df_final2

   Name  Age   Phone   Ten     Sex
0  John   27  123456  John    Male
1   Tom   25  654987   Tom    Male
2  Jane   26  123789  Jane  Female

In [8]:
lst = ['$125', '$350', '$50', '$124']
df = pd.DataFrame(lst, columns=['Price'])
df

  Price
0  $125
1  $350
2   $50
3  $124

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Price   4 non-null      object
dtypes: object(1)
memory usage: 160.0+ bytes

In [10]:
df['Price_new'] = df['Price'].str.replace('$','').astype('int16')

In [11]:
df

  Price  Price_new
0  $125        125
1  $350        350
2   $50         50
3  $124        124

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Price      4 non-null      object
 1   Price_new  4 non-null      int16
dtypes: int16(1), object(1)
memory usage: 168.0+ bytes

In [13]:
df['Price_new'] = df['Price_new'].astype('int16')

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Price      4 non-null      object
 1   Price_new  4 non-null      int16
dtypes: int16(1), object(1)
memory usage: 168.0+ bytes

In [15]:
df['Price_new2'] = df['Price'].apply(lambda x: x[1:]).astype('int16')

In [16]:
df

  Price  Price_new  Price_new2
0  $125        125         125
1  $350        350         350
2   $50         50          50
3  $124        124         124

In [17]:
lst2 = ['$125', '$350', '$50', '$124', '?']
df2 = pd.DataFrame(lst2, columns=['Price'])
df2

  Price
0  $125
1  $350
2   $50
3  $124
4     ?

In [18]:
df2['Price_new'] = df2['Price'].str.replace('$','')

In [19]:
df2['Price_new'] = pd.to_numeric(df2['Price_new'], errors='coerce')

In [20]:
df2

  Price  Price_new
0  $125      125.0
1  $350      350.0
2   $50       50.0
3  $124      124.0
4     ?        NaN

In [21]:
df2['Price_new'] = df2['Price'].str.replace('$','')
df2['Price_new'] = df2['Price'].str.replace(',','')

In [22]:
df2['Price_new'] = df2['Price'].str.replace('$','').str.replace(',','')

In [23]:
df2

  Price Price_new
0  $125       125
1  $350       350
2   $50        50
3  $124       124
4     ?         ?